Here is a little bit of information about the changeset that is causing this .. 

(output from plan)
```
  # module.pod.module.jane.module.sidekiq-service-high.module.task_definition.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:702929988523:task-definition/s-cac1-ex1-jane_sidekiq_high:18" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                    command          = [
                        "pod-launch",
                        "forerun",
                        "sidekiq_high",
                    ]
                    cpu              = 1024
                    dockerLabels     = {
                        APP_NAME                      = "jane"
                        POD_ENVIRONMENT               = "sandbox"
                        POD_NAME                      = "s-cac1-ex1"
                        POD_REGION                    = "ca-central-1"
                        POD_SERVICE                   = "jane_sidekiq_high"
                        TASK_WORKLOAD_TYPE            = "main"
                        app.jane.app_name             = "jane"
                        com.datadoghq.ad.check_names  = jsonencode([])
                        com.datadoghq.ad.init_configs = jsonencode([])
                        com.datadoghq.ad.instances    = jsonencode([])
                        com.datadoghq.ad.logs         = jsonencode(
                            [
                                {
                                    service = "jane_sidekiq_high"
                                    source  = "ruby"
                                },
                            ]
                        )
                        docker-monitor-oom            = jsonencode(
                            [
                                {
                                    signal    = "SIGINT"
                                    threshold = 95
                                },
                            ]
                        )
                    }
                  ~ environment      = [
                      - {
                          - name  = "AWS_REGION"
                          - value = "ca-central-1"
                        },
                      - {
                          - name  = "POD_SERVICE"
                          - value = "jane_sidekiq_high"
                        },
                      - {
                          - name  = "POD_NAME"
                          - value = "s-cac1-ex1"
                        },
                        {
                            name  = "APP_NAME"
                            value = "jane"
                        },
                      ~ {
                          ~ name  = "POD_ENVIRONMENT" -> "AWS_REGION"
                          ~ value = "sandbox" -> "ca-central-1"
                        },
                        {
                            name  = "LANG"
                            value = "en_US.UTF-8"
                        },
                      + {
                          + name  = "POD_ENVIRONMENT"
                          + value = "sandbox"
                        },
                      + {
                          + name  = "POD_NAME"
                          + value = "s-cac1-ex1"
                        },
                      + {
                          + name  = "POD_SERVICE"
                          + value = "jane_sidekiq_high"
                        },
                        {
                            name  = "SSM_PATHS"
                            value = "/jane,/jane/app.jane,/jane/env.sandbox,/jane/pod.s-cac1-ex1,/jane/env-app.sandbox.jane,/jane/pod-app.s-cac1-ex1.jane,/jane/pod-svc.s-cac1-ex1.jane_sidekiq_high"
                        },
                    ]
                    essential        = true
                    image            = "REDACTED"
                    logConfiguration = {
                        logDriver = "json-file"
                        options   = {
                            max-file = "3"
                            max-size = "10m"
                        }
                    }
                  ~ memory           = 1536 -> 2048
                    mountPoints      = []
                    name             = "jane_sidekiq_high"
                    portMappings     = []
                    volumesFrom      = []
                } # forces replacement,
            ]
        )
        cpu                      = "1024"
        execution_role_arn       = "arn:aws:iam::702929988523:role/s-cac1-ex1-assume-role"
        family                   = "s-cac1-ex1-jane_sidekiq_high"
      ~ id                       = "s-cac1-ex1-jane_sidekiq_high" -> (known after apply)
      ~ memory                   = "1536" -> "2048" # forces replacement
        network_mode             = "bridge"
        requires_compatibilities = [
            "EC2",
        ]
      ~ revision                 = 18 -> (known after apply)
      - tags                     = {} -> null
        task_role_arn            = "arn:aws:iam::702929988523:role/s-cac1-ex1-jane_role"
    }
```

Something about this changeset is breaking it .. 

```
Terraform will perform the following actions:

panic: runtime error: invalid memory address or nil pointer dereference
[signal SIGSEGV: segmentation violation code=0x1 addr=0x20 pc=0x133f0c6]

goroutine 1 [running]:
github.com/zclconf/go-cty/cty/set.Set.Has(0x0, 0x0, 0x0, 0x28c8d60, 0xc000248740, 0xc00125a176)
	/private/tmp/terraform-20191202-98471-1s2t0au/pkg/mod/github.com/zclconf/go-cty@v1.1.0/cty/set/ops.go:54 +0x26
github.com/zclconf/go-cty/cty.PathSet.Has(...)
	/private/tmp/terraform-20191202-98471-1s2t0au/pkg/mod/github.com/zclconf/go-cty@v1.1.0/cty/path_set.go:53
github.com/hashicorp/terraform/command/format.(*blockBodyDiffPrinter).pathForcesNewResource(0xc0006654c0, 0xc000491c50, 0x1, 0x3, 0x3e271a0)
	/private/tmp/terraform-20191202-98471-1s2t0au/src/github.com/hashicorp/terraform/command/format/diff.go:1036 +0xb7
github.com/hashicorp/terraform/command/format.(*blockBodyDiffPrinter).writeValueDiff(0xc0006654c0, 0x2ed3aa0, 0xc0000d4369, 0x264ae00, 0xc0013d5c20, 0x2ed3aa0, 0xc0000d4369, 0x270aa00, 0x3e271a0, 0x8, ...)
	/private/tmp/terraform-20191202-98471-1s2t0au/src/github.com/hashicorp/terraform/command/format/diff.go:1005 +0xf81
github.com/hashicorp/terraform/command/format.(*blockBodyDiffPrinter).writeAttrDiff(0xc0006654c0, 0xc00142d668, 0x3, 0xc000a4b980, 0x2ed3aa0, 0xc0000d4369, 0x264ae00, 0xc0013d5c20, 0x2ed3aa0, 0xc0000d4369, ...)
	/private/tmp/terraform-20191202-98471-1s2t0au/src/github.com/hashicorp/terraform/command/format/diff.go:263 +0x4c2
github.com/hashicorp/terraform/command/format.(*blockBodyDiffPrinter).writeBlockBodyDiff(0xc0006654c0, 0xc00115f780, 0x2ed3ba0, 0xc00060e1f0, 0x26f06c0, 0xc0002a15c0, 0x2ed3ba0, 0xc00060e248, 0x26f06c0, 0xc00046b530, ...)
	/private/tmp/terraform-20191202-98471-1s2t0au/src/github.com/hashicorp/terraform/command/format/diff.go:196 +0x5d2
github.com/hashicorp/terraform/command/format.ResourceChange(0xc001512300, 0x0, 0xc00115f780, 0xc00121e860, 0x4d, 0xc001294240)
	/private/tmp/terraform-20191202-98471-1s2t0au/src/github.com/hashicorp/terraform/command/format/diff.go:140 +0x601
github.com/hashicorp/terraform/backend/local.RenderPlan(0xc0003c21c0, 0xc00060e030, 0xc00128e010, 0x2ee7220, 0xc00036c260, 0xc00121e860)
	/private/tmp/terraform-20191202-98471-1s2t0au/src/github.com/hashicorp/terraform/backend/local/backend_plan.go:288 +0x67b
github.com/hashicorp/terraform/command.(*ShowCommand).Run(0xc0003196c0, 0xc0000b01a0, 0x1, 0x1, 0xc000592f20)
	/private/tmp/terraform-20191202-98471-1s2t0au/src/github.com/hashicorp/terraform/command/show.go:165 +0xb02
github.com/mitchellh/cli.(*CLI).Run(0xc000369680, 0xc000369680, 0xc000539cc0, 0x1)
	/private/tmp/terraform-20191202-98471-1s2t0au/pkg/mod/github.com/mitchellh/cli@v1.0.0/cli.go:255 +0x1da
main.wrappedMain(0x0)
	/private/tmp/terraform-20191202-98471-1s2t0au/src/github.com/hashicorp/terraform/main.go:238 +0xc44
main.realMain(0x0)
	/private/tmp/terraform-20191202-98471-1s2t0au/src/github.com/hashicorp/terraform/main.go:102 +0xb4
main.main()
	/private/tmp/terraform-20191202-98471-1s2t0au/src/github.com/hashicorp/terraform/main.go:38 +0x3a

```
```